INSERT INTO users (name, email)
VALUES ('Андрей', 'andrey@mail.ru'),
       ('Роман', 'rome@mail.ru'),
       ('Екатерина', 'kate@mail.ru'),
       ('Александр', 'alex@mail.ru'),
       ('Татьяна', 'tata@mail.ru');

INSERT INTO categories (name)
VALUES ('Историческое место'),
       ('Архитектурное сооружение'),
       ('Культурное наследие');

INSERT INTO cities (name, country)
VALUES ('Париж', 'Франция'),
       ('Рим', 'Италия'),
       ('Пекин', 'Китай'),
       ('Агра', 'Индия'),
       ('Петра', 'Иордания');

INSERT INTO locations (lat, lon)
VALUES (48.8584, 2.2945),
       (41.8902, 12.4922),
       (40.4319, 116.5704),
       (27.1751, 78.0421),
       (30.3285, 35.4444),
       (48.8606, 2.3376),
       (41.9029, 12.4815),
       (39.9163, 116.3972),
       (27.1842, 78.0177),
       (29.5303, 35.4444);

INSERT INTO attraction (name, category_id, location_id, city_id)
VALUES ('Эйфелева башня', 2, 1, 1),
       ('Лувр', 3, 6, 1),
       ('Колизей', 2, 2, 2),
       ('Фонтан Треви', 2, 7, 2),
       ('Великая китайская стена', 1, 3, 3),
       ('Запретный город', 3, 8, 3),
       ('Тадж-Махал', 2, 4, 4),
       ('Фортеца Агры', 2, 9, 4),
       ('Петра', 1, 5, 5),
       ('Вади Рам', 1, 10, 5);